Revit 2024 API
BuiltInFailures.WallJoinRoofFailures Class
 Failures about WallJoinRoof.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class WallJoinRoofFailures
Visual Basic
Public NotInheritable Class WallJoinRoofFailures
Visual C++
public ref class WallJoinRoofFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.WallJoinRoofFailures
See Also
BuiltInFailures.WallJoinRoofFailures Members
Autodesk.Revit.DB Namespace